emineminof/DWM3000-ATMega328p/DW3000/DW3000/driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register DX_TIME
**/
#define DX_TIME_ID                           0x2c                 
#define DX_TIME_LEN                          (4U)                
#define DX_TIME_MASK                         0xFFFFFFFFUL        
#define DX_TIME_DX_TIME_BIT_OFFSET           (1U)                
#define DX_TIME_DX_TIME_BIT_LEN              (31U)               
#define DX_TIME_DX_TIME_BIT_MASK             0xfffffffeUL         

/******************************************************************************
* @brief Bit definitions for register DREF_TIME
**/
#define DREF_TIME_ID                         0x30                 
#define DREF_TIME_LEN                        (4U)                
#define DREF_TIME_MASK                       0xFFFFFFFFUL        
#define DREF_TIME_DREF_BIT_OFFSET            (1U)                
#define DREF_TIME_DREF_BIT_LEN               (31U)               
#define DREF_TIME_DREF_BIT_MASK              0xfffffffeUL         

/******************************************************************************
* @brief Bit definitions for register RX_FWTO
**/
#define RX_FWTO_ID                           0x34                 
#define RX_FWTO_LEN                          (4U)                
#define RX_FWTO_MASK                         0xFFFFFFFFUL        
#define RX_FWTO_FWTO_BIT_OFFSET              (0U)                
#define RX_FWTO_FWTO_BIT_LEN                 (20U)               
#define RX_FWTO_FWTO_BIT_MASK                0xfffffUL            

/******************************************************************************
* @brief Bit definitions for register SYS_ENABLE_LO
**/
#define SYS_ENABLE_LO_ID                     0x3c                 
#define SYS_ENABLE_LO_LEN                    (4U)                
#define SYS_ENABLE_LO_MASK                   0xFFFFFFFFUL        
#define SYS_ENABLE_LO_ARFE_ENABLE_BIT_OFFSET (29U)               
#define SYS_ENABLE_LO_ARFE_ENABLE_BIT_LEN    (1U)                
#define SYS_ENABLE_LO_ARFE_ENABLE_BIT_MASK   0x20000000UL         
#define SYS_ENABLE_LO_CPERR_ENABLE_BIT_OFFSET (28U)               
#define SYS_ENABLE_LO_CPERR_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_CPERR_ENABLE_BIT_MASK  0x10000000UL         
#define SYS_ENABLE_LO_HPDWARN_ENABLE_BIT_OFFSET (27U)               
#define SYS_ENABLE_LO_HPDWARN_ENABLE_BIT_LEN (1U)                
#define SYS_ENABLE_LO_HPDWARN_ENABLE_BIT_MASK 0x8000000UL          
#define SYS_ENABLE_LO_RXSTO_ENABLE_BIT_OFFSET (26U)               
#define SYS_ENABLE_LO_RXSTO_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_RXSTO_ENABLE_BIT_MASK  0x4000000UL          
#define SYS_ENABLE_LO_PLL_HILO_ENABLE_BIT_OFFSET (25U)               
#define SYS_ENABLE_LO_PLL_HILO_ENABLE_BIT_LEN (1U)                
#define SYS_ENABLE_LO_PLL_HILO_ENABLE_BIT_MASK 0x2000000UL          
#define SYS_ENABLE_LO_RCINIT_ENABLE_BIT_OFFSET (24U)               
#define SYS_ENABLE_LO_RCINIT_ENABLE_BIT_LEN  (1U)                
#define SYS_ENABLE_LO_RCINIT_ENABLE_BIT_MASK 0x1000000UL          
#define SYS_ENABLE_LO_SPIRDY_ENABLE_BIT_OFFSET (23U)               
#define SYS_ENABLE_LO_SPIRDY_ENABLE_BIT_LEN  (1U)                
#define SYS_ENABLE_LO_SPIRDY_ENABLE_BIT_MASK 0x800000UL           
#define SYS_ENABLE_LO_RXPTO_ENABLE_BIT_OFFSET (21U)               
#define SYS_ENABLE_LO_RXPTO_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_RXPTO_ENABLE_BIT_MASK  0x200000UL           
#define SYS_ENABLE_LO_RXOVRR_ENABLE_BIT_OFFSET (20U)               
#define SYS_ENABLE_LO_RXOVRR_ENABLE_BIT_LEN  (1U)                
#define SYS_ENABLE_LO_RXOVRR_ENABLE_BIT_MASK 0x100000UL           
#define SYS_ENABLE_LO_VWARN_ENABLE_BIT_OFFSET (19U)               
#define SYS_ENABLE_LO_VWARN_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_VWARN_ENABLE_BIT_MASK  0x80000UL            
#define SYS_ENABLE_LO_CIAERR_ENABLE_BIT_OFFSET (18U)               
#define SYS_ENABLE_LO_CIAERR_ENABLE_BIT_LEN  (1U)                
#define SYS_ENABLE_LO_CIAERR_ENABLE_BIT_MASK 0x40000UL            
#define SYS_ENABLE_LO_RXFTO_ENABLE_BIT_OFFSET (17U)               
#define SYS_ENABLE_LO_RXFTO_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_RXFTO_ENABLE_BIT_MASK  0x20000UL            
#define SYS_ENABLE_LO_RXFSL_ENABLE_BIT_OFFSET (16U)               
#define SYS_ENABLE_LO_RXFSL_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_RXFSL_ENABLE_BIT_MASK  0x10000UL            
#define SYS_ENABLE_LO_RXFCE_ENABLE_BIT_OFFSET (15U)               
#define SYS_ENABLE_LO_RXFCE_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_RXFCE_ENABLE_BIT_MASK  0x8000U              
#define SYS_ENABLE_LO_RXFCG_ENABLE_BIT_OFFSET (14U)               
#define SYS_ENABLE_LO_RXFCG_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_RXFCG_ENABLE_BIT_MASK  0x4000U              
#define SYS_ENABLE_LO_RXFR_ENABLE_BIT_OFFSET (13U)               
#define SYS_ENABLE_LO_RXFR_ENABLE_BIT_LEN    (1U)                
#define SYS_ENABLE_LO_RXFR_ENABLE_BIT_MASK   0x2000U              
#define SYS_ENABLE_LO_RXPHE_ENABLE_BIT_OFFSET (12U)               
#define SYS_ENABLE_LO_RXPHE_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_RXPHE_ENABLE_BIT_MASK  0x1000U              
#define SYS_ENABLE_LO_RXPHD_ENABLE_BIT_OFFSET (11U)               
#define SYS_ENABLE_LO_RXPHD_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_RXPHD_ENABLE_BIT_MASK  0x800U               
#define SYS_ENABLE_LO_CIADONE_ENABLE_BIT_OFFSET (10U)               
#define SYS_ENABLE_LO_CIADONE_ENABLE_BIT_LEN (1U)                
#define SYS_ENABLE_LO_CIADONE_ENABLE_BIT_MASK 0x400U               
#define SYS_ENABLE_LO_RXSFDD_ENABLE_BIT_OFFSET (9U)                
#define SYS_ENABLE_LO_RXSFDD_ENABLE_BIT_LEN  (1U)                
#define SYS_ENABLE_LO_RXSFDD_ENABLE_BIT_MASK 0x200U               
#define SYS_ENABLE_LO_RXPRD_ENABLE_BIT_OFFSET (8U)                
#define SYS_ENABLE_LO_RXPRD_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_RXPRD_ENABLE_BIT_MASK  0x100U               
#define SYS_ENABLE_LO_TXFRS_ENABLE_BIT_OFFSET (7U)                
#define SYS_ENABLE_LO_TXFRS_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_TXFRS_ENABLE_BIT_MASK  0x80U                
#define SYS_ENABLE_LO_TXPHS_ENABLE_BIT_OFFSET (6U)                
#define SYS_ENABLE_LO_TXPHS_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_TXPHS_ENABLE_BIT_MASK  0x40U                
#define SYS_ENABLE_LO_TXPRS_ENABLE_BIT_OFFSET (5U)                
#define SYS_ENABLE_LO_TXPRS_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_TXPRS_ENABLE_BIT_MASK  0x20U                
#define SYS_ENABLE_LO_TXFRB_ENABLE_BIT_OFFSET (4U)                
#define SYS_ENABLE_LO_TXFRB_ENABLE_BIT_LEN   (1U)                
#define SYS_ENABLE_LO_TXFRB_ENABLE_BIT_MASK  0x10U                
#define SYS_ENABLE_LO_AAT_ENABLE_BIT_OFFSET  (3U)                
#define SYS_ENABLE_LO_AAT_ENABLE_BIT_LEN     (1U)                
#define SYS_ENABLE_LO_AAT_ENABLE_BIT_MASK    0x8U                 
#define SYS_ENABLE_LO_SPICRCE_ENABLE_BIT_OFFSET (2U)                
#define SYS_ENABLE_LO_SPICRCE_ENABLE_BIT_LEN    (1U)                
#define SYS_ENABLE_LO_SPICRCE_ENABLE_BIT_MASK    0x4U                 
#define SYS_ENABLE_LO_CP_LOCK_ENABLE_BIT_OFFSET (1U)                
#define SYS_ENABLE_LO_CP_LOCK_ENABLE_BIT_LEN    (1U)                
#define SYS_ENABLE_LO_CP_LOCK_ENABLE_BIT_MASK   0x2U                 

