emineminof/DWM3000-ATMega328p/DW3000/DW3000/driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register SYS_STATUS_HI
**/
#define SYS_STATUS_HI_ID                     0x48                 
#define SYS_STATUS_HI_LEN                    (4U)                
#define SYS_STATUS_HI_MASK                   0xFFFFFFFFUL        
#define SYS_STATUS_HI_CCA_FAIL_BIT_OFFSET    (12U)               
#define SYS_STATUS_HI_CCA_FAIL_BIT_LEN       (1U)                
#define SYS_STATUS_HI_CCA_FAIL_BIT_MASK      0x1000U              
#define SYS_STATUS_HI_SPIERR_BIT_OFFSET (11U)               
#define SYS_STATUS_HI_SPIERR_BIT_LEN  (1U)                
#define SYS_STATUS_HI_SPIERR_BIT_MASK 0x800U               
#define SYS_STATUS_HI_SPI_UNF_BIT_OFFSET     (10U)               
#define SYS_STATUS_HI_SPI_UNF_BIT_LEN        (1U)                
#define SYS_STATUS_HI_SPI_UNF_BIT_MASK       0x400U               
#define SYS_STATUS_HI_SPI_OVF_BIT_OFFSET     (9U)                
#define SYS_STATUS_HI_SPI_OVF_BIT_LEN        (1U)                
#define SYS_STATUS_HI_SPI_OVF_BIT_MASK       0x200U               
#define SYS_STATUS_HI_CMD_ERR_BIT_OFFSET     (8U)                
#define SYS_STATUS_HI_CMD_ERR_BIT_LEN        (1U)                
#define SYS_STATUS_HI_CMD_ERR_BIT_MASK       0x100U               
#define SYS_STATUS_HI_AES_ERR_BIT_OFFSET     (7U)                
#define SYS_STATUS_HI_AES_ERR_BIT_LEN        (1U)                
#define SYS_STATUS_HI_AES_ERR_BIT_MASK       0x80U                
#define SYS_STATUS_HI_AES_DONE_BIT_OFFSET    (6U)                
#define SYS_STATUS_HI_AES_DONE_BIT_LEN       (1U)                
#define SYS_STATUS_HI_AES_DONE_BIT_MASK      0x40U                
#define SYS_STATUS_HI_GPIO_IRQ_BIT_OFFSET        (5U)                
#define SYS_STATUS_HI_GPIO_IRQ_BIT_LEN           (1U)                
#define SYS_STATUS_HI_GPIO_IRQ_BIT_MASK          0x20U                
#define SYS_STATUS_HI_VT_DET_BIT_OFFSET      (4U)                
#define SYS_STATUS_HI_VT_DET_BIT_LEN         (1U)                
#define SYS_STATUS_HI_VT_DET_BIT_MASK        0x10U                
#define SYS_STATUS_HI_RXPREJ_BIT_OFFSET      (1U)                
#define SYS_STATUS_HI_RXPREJ_BIT_LEN         (1U)                
#define SYS_STATUS_HI_RXPREJ_BIT_MASK        0x2U                 
              

/******************************************************************************
* @brief Bit definitions for register RX_FINFO
**/
#define RX_FINFO_ID                          0x4c                 
#define RX_FINFO_LEN                         (4U)                
#define RX_FINFO_MASK                        0xFFFFFFFFUL        
#define RX_FINFO_RXPACC_BIT_OFFSET           (20U)               
#define RX_FINFO_RXPACC_BIT_LEN              (12U)               
#define RX_FINFO_RXPACC_BIT_MASK             0xfff00000UL         
#define RX_FINFO_RXPSR_BIT_OFFSET            (18U)               
#define RX_FINFO_RXPSR_BIT_LEN               (2U)                
#define RX_FINFO_RXPSR_BIT_MASK              0xc0000UL            
#define RX_FINFO_RXPRF_BIT_OFFSET            (16U)               
#define RX_FINFO_RXPRF_BIT_LEN               (2U)                
#define RX_FINFO_RXPRF_BIT_MASK              0x30000UL            
#define RX_FINFO_RNG_BIT_OFFSET              (15U)               
#define RX_FINFO_RNG_BIT_LEN                 (1U)                
#define RX_FINFO_RNG_BIT_MASK                0x8000U              
#define RX_FINFO_RXBR_BIT_OFFSET             (13U)               
#define RX_FINFO_RXBR_BIT_LEN                (1U)                
#define RX_FINFO_RXBR_BIT_MASK               0x2000U              
#define RX_FINFO_RXNSPL_BIT_OFFSET           (11U)               
#define RX_FINFO_RXNSPL_BIT_LEN              (2U)                
#define RX_FINFO_RXNSPL_BIT_MASK             0x1800U              
#define RX_FINFO_RXFLEN_BIT_OFFSET           (0U)                
#define RX_FINFO_RXFLEN_BIT_LEN              (10U)               
#define RX_FINFO_RXFLEN_BIT_MASK             0x3ffU               





/******************************************************************************
* @brief Bit definitions for register RX_TIME_0
**/
#define RX_TIME_0_ID                         0x64                 
#define RX_TIME_0_LEN                        (4U)                
#define RX_TIME_0_MASK                       0xFFFFFFFFUL        



/******************************************************************************
* @brief Bit definitions for register RX_TIME_RAW
**/
#define RX_TIME_RAW_ID                         0x70                 
#define RX_TIME_RAW_LEN                        (4U)                
#define RX_TIME_RAW_MASK                       0xFFFFFFFFUL        
#define RX_TIME_RX_RAWST_BIT_OFFSET (0U)                
#define RX_TIME_RX_RAWST_BIT_LEN (32U)               
#define RX_TIME_RX_RAWST_BIT_MASK 0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register TX_TIME_LO
**/
#define TX_TIME_LO_ID                        0x74                 
#define TX_TIME_LO_LEN                       (4U)                
#define TX_TIME_LO_MASK                      0xFFFFFFFFUL        


/******************************************************************************
* @brief Bit definitions for register TX_TIME_RAW
**/
#define TX_TIME_RAW_ID                         0x10000              
#define TX_TIME_RAW_LEN                        (4U)                
#define TX_TIME_RAW_MASK                       0xFFFFFFFFUL        
#define TX_TIME_TX_RAWST_BIT_OFFSET (0U)                
#define TX_TIME_TX_RAWST_BIT_LEN (32U)               
#define TX_TIME_TX_RAWST_BIT_MASK 0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register TX_ANTD
**/
#define TX_ANTD_ID                           0x10004              
#define TX_ANTD_LEN                          (4U)                
#define TX_ANTD_MASK                         0xFFFFFFFFUL        

