emineminof/DWM3000-ATMega328p/DW3000/DW3000/driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register AES_KEY3
**/
#define AES_KEY3_ID                          0x10060              
#define AES_KEY3_LEN                         (4U)                
#define AES_KEY3_MASK                        0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_CFG0
**/
#define STS_CFG0_ID                           0x20000              
#define STS_CFG0_LEN                          (4U)                
#define STS_CFG0_MASK                         0xFFFFFFFFUL        
#define STS_CFG0_CPS_LEN_BIT_OFFSET         (0U)                
#define STS_CFG0_CPS_LEN_BIT_LEN            (8U)                
#define STS_CFG0_CPS_LEN_BIT_MASK           0xffU                

/******************************************************************************
* @brief Bit definitions for register STS_CTRL
**/
#define STS_CTRL_ID                           0x20004              
#define STS_CTRL_LEN                          (4U)                
#define STS_CTRL_MASK                         0xFFFFFFFFUL        
#define STS_CTRL_RST_LAST_BIT_OFFSET (1U)                
#define STS_CTRL_RST_LAST_BIT_LEN (1U)                
#define STS_CTRL_RST_LAST_BIT_MASK 0x2U                 
#define STS_CTRL_LOAD_IV_BIT_OFFSET        (0U)                
#define STS_CTRL_LOAD_IV_BIT_LEN           (1U)                
#define STS_CTRL_LOAD_IV_BIT_MASK          0x1U                 

/******************************************************************************
* @brief Bit definitions for register STS_STS
**/
#define STS_STS_ID                            0x20008              
#define STS_STS_LEN                           (4U)                
#define STS_STS_MASK                          0xFFFFFFFFUL        
#define STS_STS_ACC_QUAL_BIT_OFFSET           (0U)                
#define STS_STS_ACC_QUAL_BIT_LEN              (12U)               
#define STS_STS_ACC_QUAL_BIT_MASK             0xfffU               

/******************************************************************************
* @brief Bit definitions for register STS_KEY0
**/
#define STS_KEY0_ID                           0x2000c              
#define STS_KEY0_LEN                          (4U)                
#define STS_KEY0_MASK                         0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_KEY1
**/
#define STS_KEY1_ID                           0x20010              
#define STS_KEY1_LEN                          (4U)                
#define STS_KEY1_MASK                         0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_KEY2
**/
#define STS_KEY2_ID                           0x20014              
#define STS_KEY2_LEN                          (4U)                
#define STS_KEY2_MASK                         0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_KEY3
**/
#define STS_KEY3_ID                           0x20018              
#define STS_KEY3_LEN                          (4U)                
#define STS_KEY3_MASK                         0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_IV0
**/
#define STS_IV0_ID                            0x2001c              
#define STS_IV0_LEN                           (4U)                
#define STS_IV0_MASK                          0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_IV1
**/
#define STS_IV1_ID                            0x20020              
#define STS_IV1_LEN                           (4U)                
#define STS_IV1_MASK                          0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_IV2
**/
#define STS_IV2_ID                            0x20024              
#define STS_IV2_LEN                           (4U)                
#define STS_IV2_MASK                          0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_IV3
**/
#define STS_IV3_ID                            0x20028              
#define STS_IV3_LEN                           (4U)                
#define STS_IV3_MASK                          0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register LCSS_MARGIN
**/
#define LCSS_MARGIN_ID                       0x20034              

/******************************************************************************
* @brief Bit definitions for register DGC_CFG
**/
#define DGC_CFG_ID                           0x30018              
#define DGC_CFG_LEN                          (4U)                
#define DGC_CFG_MASK                         0xFFFFFFFFUL    
#define DGC_CFG_THR_64_BIT_OFFSET            (9U)                
#define DGC_CFG_THR_64_BIT_LEN               (6U)                
#define DGC_CFG_THR_64_BIT_MASK              0x7e00U  
#define DGC_CFG_RX_TUNE_EN_BIT_OFFSET        (0U)                
#define DGC_CFG_RX_TUNE_EN_BIT_LEN           (1U)                
#define DGC_CFG_RX_TUNE_EN_BIT_MASK          0x1U                 

/******************************************************************************
* @brief Bit definitions for register DGC_CFG0
**/
#define DGC_CFG0_ID              0x3001c              
#define DGC_CFG0_LEN             (4U)                
#define DGC_CFG0_MASK            0xFFFFFFFFUL        

