emineminof/DWM3000-ATMega328p/DW3000/DW3000/driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register RF_CTRL_MASK
**/
#define RF_CTRL_MASK_ID                      0x70004              
#define RF_CTRL_MASK_LEN                     (4U)                
#define RF_CTRL_MASK_MASK                    0xFFFFFFFFUL        



/******************************************************************************
* @brief Bit definitions for register RX_CTRL_HI
**/
#define RX_CTRL_HI_ID                        0x70010              
#define RX_CTRL_HI_LEN                       (4U)                
#define RX_CTRL_HI_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register RF_SWITCH
**/
#define RF_SWITCH_CTRL_ID                         0x70014              
#define RF_SWITCH_CTRL_LEN                        (4U)                
#define RF_SWITCH_CTRL_MASK                       0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register TX_CTRL_LO
**/
#define TX_CTRL_LO_ID                        0x70018              
#define TX_CTRL_LO_LEN                       (4U)                
#define TX_CTRL_LO_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register TX_CTRL_HI
**/
#define TX_CTRL_HI_ID                        0x7001c              
#define TX_CTRL_HI_LEN                       (4U)                
#define TX_CTRL_HI_MASK                      0xFFFFFFFFUL        
#define TX_CTRL_HI_TX_PG_DELAY_BIT_OFFSET    (0U)                
#define TX_CTRL_HI_TX_PG_DELAY_BIT_LEN       (6U)                
#define TX_CTRL_HI_TX_PG_DELAY_BIT_MASK      0x3fU                


/******************************************************************************
* @brief Bit definitions for register TX_TEST
**/
#define TX_TEST_ID                           0x70028              
#define TX_TEST_LEN                          (4U)                
#define TX_TEST_MASK                         0xFFFFFFFFUL        
#define TX_TEST_TX_ENTEST_CH1_BIT_OFFSET     (3U)                
#define TX_TEST_TX_ENTEST_CH1_BIT_LEN        (1U)                
#define TX_TEST_TX_ENTEST_CH1_BIT_MASK       0x8U                 
#define TX_TEST_TX_ENTEST_CH2_BIT_OFFSET     (2U)                
#define TX_TEST_TX_ENTEST_CH2_BIT_LEN        (1U)                
#define TX_TEST_TX_ENTEST_CH2_BIT_MASK       0x4U                 
#define TX_TEST_TX_ENTEST_CH3_BIT_OFFSET     (1U)                
#define TX_TEST_TX_ENTEST_CH3_BIT_LEN        (1U)                
#define TX_TEST_TX_ENTEST_CH3_BIT_MASK       0x2U                 
#define TX_TEST_TX_ENTEST_CH4_BIT_OFFSET     (0U)                
#define TX_TEST_TX_ENTEST_CH4_BIT_LEN        (1U)                
#define TX_TEST_TX_ENTEST_CH4_BIT_MASK       0x1U                 



/******************************************************************************
* @brief Bit definitions for register SAR_TEST
**/
#define SAR_TEST_ID                          0x70034              
#define SAR_TEST_LEN                         (4U)                
#define SAR_TEST_MASK                        0xFFFFFFFFUL        
#define SAR_TEST_SAR_RDEN_BIT_OFFSET    (2U)                
#define SAR_TEST_SAR_RDEN_BIT_LEN       (1U)                
#define SAR_TEST_SAR_RDEN_BIT_MASK      0x4U                 


/******************************************************************************
* @brief Bit definitions for register LDO_TUNE_LO
**/
#define LDO_TUNE_LO_ID                       0x70040              
#define LDO_TUNE_LO_LEN                      (4U)                
#define LDO_TUNE_LO_MASK                     0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register LDO_TUNE_HI
**/
#define LDO_TUNE_HI_ID                       0x70044              
#define LDO_TUNE_HI_LEN                      (4U)                
#define LDO_TUNE_HI_MASK                     0xFFFFFFFFUL        
#define LDO_TUNE_HI_LDO_HVAUX_TUNE_BIT_OFFSET (12U)               
#define LDO_TUNE_HI_LDO_HVAUX_TUNE_BIT_LEN   (4U)                
#define LDO_TUNE_HI_LDO_HVAUX_TUNE_BIT_MASK  0xf000U              

/******************************************************************************
* @brief Bit definitions for register LDO_CTRL
**/
#define LDO_CTRL_ID                          0x70048              
#define LDO_CTRL_LEN                         (4U)                
#define LDO_CTRL_MASK                        0xFFFFFFFFUL        
#define LDO_CTRL_LDO_VDDHVTX_VREF_BIT_OFFSET (27U)               
#define LDO_CTRL_LDO_VDDHVTX_VREF_BIT_LEN    (1U)                
#define LDO_CTRL_LDO_VDDHVTX_VREF_BIT_MASK   0x8000000UL          
#define LDO_CTRL_LDO_VDDTX2_VREF_BIT_OFFSET  (22U)               
#define LDO_CTRL_LDO_VDDTX2_VREF_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDTX2_VREF_BIT_MASK    0x400000UL           
#define LDO_CTRL_LDO_VDDTX1_VREF_BIT_OFFSET  (21U)               
#define LDO_CTRL_LDO_VDDTX1_VREF_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDTX1_VREF_BIT_MASK    0x200000UL           
#define LDO_CTRL_LDO_VDDHVTX_EN_BIT_OFFSET   (11U)               
#define LDO_CTRL_LDO_VDDHVTX_EN_BIT_LEN      (1U)                
#define LDO_CTRL_LDO_VDDHVTX_EN_BIT_MASK     0x800U               
#define LDO_CTRL_LDO_VDDIF2_EN_BIT_OFFSET    (8U)                
#define LDO_CTRL_LDO_VDDIF2_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDIF2_EN_BIT_MASK      0x100U               
#define LDO_CTRL_LDO_VDDTX2_EN_BIT_OFFSET    (6U)                
#define LDO_CTRL_LDO_VDDTX2_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDTX2_EN_BIT_MASK      0x40U                
#define LDO_CTRL_LDO_VDDTX1_EN_BIT_OFFSET    (5U)                
#define LDO_CTRL_LDO_VDDTX1_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDTX1_EN_BIT_MASK      0x20U                
#define LDO_CTRL_LDO_VDDPLL_EN_BIT_OFFSET    (4U)                
#define LDO_CTRL_LDO_VDDPLL_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDPLL_EN_BIT_MASK      0x10U                
#define LDO_CTRL_LDO_VDDMS3_EN_BIT_OFFSET    (2U)                
#define LDO_CTRL_LDO_VDDMS3_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDMS3_EN_BIT_MASK      0x4U                 
#define LDO_CTRL_LDO_VDDMS2_EN_BIT_OFFSET    (1U)                
#define LDO_CTRL_LDO_VDDMS2_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDMS2_EN_BIT_MASK      0x2U                 
#define LDO_CTRL_LDO_VDDMS1_EN_BIT_OFFSET    (0U)                
#define LDO_CTRL_LDO_VDDMS1_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDMS1_EN_BIT_MASK      0x1U                 


