emineminof/DWM3000-ATMega328p/DW3000/DW3000/driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register PLL_CFG
**/
#define PLL_CFG_ID                           0x90000              
#define PLL_CFG_LEN                          (4U)                
#define PLL_CFG_MASK                         0xFFFFFFFFUL        


/******************************************************************************
* @brief Bit definitions for register PLL_CAL
**/
#define PLL_CAL_ID                           0x90008              
#define PLL_CAL_LEN                          (4U)                
#define PLL_CAL_MASK                         0xFFFFFFFFUL        



/******************************************************************************
* @brief Bit definitions for register XTAL
**/
#define XTAL_ID                              0x90014              
#define XTAL_LEN                             (4U)                
#define XTAL_MASK                            0xFFFFFFFFUL        
#define XTAL_XTAL_TRIM_BIT_OFFSET            (0U)                
#define XTAL_XTAL_TRIM_BIT_LEN               (7U)                
#define XTAL_XTAL_TRIM_BIT_MASK              0x7fU                


/******************************************************************************
* @brief Bit definitions for register AON_DIG_CFG
**/
#define AON_DIG_CFG_ID                       0xa0000         
#define AON_DIG_CFG_LEN                      (4U)                
#define AON_DIG_CFG_MASK                     0xFFFFFFFFUL      
#define AON_DIG_CFG_ONWAKE_GO2RX_BIT_OFFSET  (9U)                
#define AON_DIG_CFG_ONWAKE_GO2RX_BIT_LEN     (1U)                
#define AON_DIG_CFG_ONWAKE_GO2RX_BIT_MASK    0x200U               
#define AON_DIG_CFG_ONWAKE_GO2IDLE_BIT_OFFSET (8U)                
#define AON_DIG_CFG_ONWAKE_GO2IDLE_BIT_LEN   (1U)                
#define AON_DIG_CFG_ONWAKE_GO2IDLE_BIT_MASK  0x100U                              
#define AON_DIG_CFG_ONWAKE_RUN_SAR_BIT_OFFSET (1U)                
#define AON_DIG_CFG_ONWAKE_RUN_SAR_BIT_LEN   (1U)                
#define AON_DIG_CFG_ONWAKE_RUN_SAR_BIT_MASK  0x2U                 
#define AON_DIG_CFG_ONWAKE_AON_DLD_BIT_OFFSET (0U)                
#define AON_DIG_CFG_ONWAKE_AON_DLD_BIT_LEN   (1U)                
#define AON_DIG_CFG_ONWAKE_AON_DLD_BIT_MASK  0x1U                 

/******************************************************************************
* @brief Bit definitions for register AON_CTRL
**/
#define AON_CTRL_ID                          0xa0004              
#define AON_CTRL_LEN                         (4U)                
#define AON_CTRL_MASK                        0xFFFFFFFFUL        
#define AON_CTRL_DCA_ENAB_BIT_OFFSET      (7U)                
#define AON_CTRL_DCA_ENAB_BIT_LEN         (1U)                
#define AON_CTRL_DCA_ENAB_BIT_MASK        0x80U                              
#define AON_CTRL_DCA_WRITE_HI_EN_BIT_OFFSET    (5U)                
#define AON_CTRL_DCA_WRITE_HI_EN_BIT_LEN       (1U)                
#define AON_CTRL_DCA_WRITE_HI_EN_BIT_MASK      0x20U                
#define AON_CTRL_DCA_WRITE_EN_BIT_OFFSET     (4U)                
#define AON_CTRL_DCA_WRITE_EN_BIT_LEN        (1U)                
#define AON_CTRL_DCA_WRITE_EN_BIT_MASK       0x10U                
#define AON_CTRL_DCA_READ_EN_BIT_OFFSET      (3U)                
#define AON_CTRL_DCA_READ_EN_BIT_LEN         (1U)                
#define AON_CTRL_DCA_READ_EN_BIT_MASK        0x8U                 
#define AON_CTRL_CONFIG_UPLOAD_BIT_OFFSET    (2U)                
#define AON_CTRL_CONFIG_UPLOAD_BIT_LEN       (1U)                
#define AON_CTRL_CONFIG_UPLOAD_BIT_MASK      0x4U                 
#define AON_CTRL_ARRAY_SAVE_BIT_OFFSET     (1U)                
#define AON_CTRL_ARRAY_SAVE_BIT_LEN        (1U)                
#define AON_CTRL_ARRAY_SAVE_BIT_MASK       0x2U                 
#define AON_CTRL_ARRAY_RESTORE_BIT_OFFSET   (0U)                
#define AON_CTRL_ARRAY_RESTORE_BIT_LEN      (1U)                
#define AON_CTRL_ARRAY_RESTORE_BIT_MASK     0x1U                 

/******************************************************************************
* @brief Bit definitions for register AON_RDATA
**/
#define AON_RDATA_ID                         0xa0008              
#define AON_RDATA_LEN                        (4U)                
#define AON_RDATA_MASK                       0xFFFFFFFFUL        
#define AON_RDATA_RDATA_BIT_OFFSET           (0U)                
#define AON_RDATA_RDATA_BIT_LEN              (8U)                
#define AON_RDATA_RDATA_BIT_MASK             0xffU                

/******************************************************************************
* @brief Bit definitions for register AON_ADDR
**/
#define AON_ADDR_ID                          0xa000c              
#define AON_ADDR_LEN                         (4U)                
#define AON_ADDR_MASK                        0xFFFFFFFFUL        
#define AON_ADDR_ADDR_BIT_OFFSET             (0U)                
#define AON_ADDR_ADDR_BIT_LEN                (9U)                
#define AON_ADDR_ADDR_BIT_MASK               0x1ffU               

/******************************************************************************
* @brief Bit definitions for register AON_WDATA
**/
#define AON_WDATA_ID                         0xa0010              
#define AON_WDATA_LEN                        (4U)                
#define AON_WDATA_MASK                       0xFFFFFFFFUL        
#define AON_WDATA_WDATA_BIT_OFFSET           (0U)                
#define AON_WDATA_WDATA_BIT_LEN              (8U)                
#define AON_WDATA_WDATA_BIT_MASK             0xffU                

/******************************************************************************
* @brief Bit definitions for register ANA_CFG
**/
#define ANA_CFG_ID                           0xa0014              
#define ANA_CFG_LEN                          (4U)                
#define ANA_CFG_MASK                         0xFFFFFFFFUL                       
#define ANA_CFG_PRES_SLEEP_BIT_OFFSET    (5U)                
#define ANA_CFG_PRES_SLEEP_BIT_LEN       (1U)                
#define ANA_CFG_PRES_SLEEP_BIT_MASK      0x20U                
#define ANA_CFG_WAKE_WUP_BIT_OFFSET        (4U)                
#define ANA_CFG_WAKE_WUP_BIT_LEN           (1U)                
#define ANA_CFG_WAKE_WUP_BIT_MASK          0x10U                
#define ANA_CFG_WAKE_CSN_BIT_OFFSET        (3U)                
#define ANA_CFG_WAKE_CSN_BIT_LEN           (1U)                
#define ANA_CFG_WAKE_CSN_BIT_MASK          0x8U                 
#define ANA_CFG_BROUT_EN_BIT_OFFSET     (2U)                
#define ANA_CFG_BROUT_EN_BIT_LEN        (1U)                
#define ANA_CFG_BROUT_EN_BIT_MASK       0x4U                 
#define ANA_CFG_WAKE_CNT_BIT_OFFSET      (1U)                
#define ANA_CFG_WAKE_CNT_BIT_LEN         (1U)                
#define ANA_CFG_WAKE_CNT_BIT_MASK        0x2U                 
#define ANA_CFG_SLEEP_EN_BIT_OFFSET          (0U)                
#define ANA_CFG_SLEEP_EN_BIT_LEN             (1U)                
#define ANA_CFG_SLEEP_EN_BIT_MASK            0x1U                 

