emineminof/DWM3000-ATMega328p/DW3000/DW3000/driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register IP_DIAG_2
**/
#define IP_DIAG_2_ID                         0xc0030              
#define IP_DIAG_2_LEN                        (4U)                
#define IP_DIAG_2_MASK                       0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_3
**/
#define IP_DIAG_3_ID                         0xc0034              
#define IP_DIAG_3_LEN                        (4U)                
#define IP_DIAG_3_MASK                       0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_4
**/
#define IP_DIAG_4_ID                         0xc0038              
#define IP_DIAG_4_LEN                        (4U)                
#define IP_DIAG_4_MASK                       0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_5
**/
#define IP_DIAG_5_ID                         0xc003c              
#define IP_DIAG_5_LEN                        (4U)                
#define IP_DIAG_5_MASK                       0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_6
**/
#define IP_DIAG_6_ID                         0xc0040              
#define IP_DIAG_6_LEN                        (4U)                
#define IP_DIAG_6_MASK                       0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_7
**/
#define IP_DIAG_7_ID                         0xc0044              
#define IP_DIAG_7_LEN                        (4U)                
#define IP_DIAG_7_MASK                       0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_8
**/
#define IP_DIAG_8_ID                         0xc0048              
#define IP_DIAG_8_LEN                        (4U)                
#define IP_DIAG_8_MASK                       0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_9
**/
#define IP_DIAG_9_ID                         0xc004c              
#define IP_DIAG_9_LEN                        (4U)                
#define IP_DIAG_9_MASK                       0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_10
**/
#define IP_DIAG_10_ID                        0xc0050              
#define IP_DIAG_10_LEN                       (4U)                
#define IP_DIAG_10_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_11
**/
#define IP_DIAG_11_ID                        0xc0054              
#define IP_DIAG_11_LEN                       (4U)                
#define IP_DIAG_11_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_12
**/
#define IP_DIAG_12_ID                        0xc0058              
#define IP_DIAG_12_LEN                       (4U)                
#define IP_DIAG_12_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_0
**/
#define STS_DIAG_0_ID                        0xc005c              
#define STS_DIAG_0_LEN                       (4U)                
#define STS_DIAG_0_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_1
**/
#define STS_DIAG_1_ID                        0xc0060              
#define STS_DIAG_1_LEN                       (4U)                
#define STS_DIAG_1_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_2
**/
#define STS_DIAG_2_ID                        0xc0064              
#define STS_DIAG_2_LEN                       (4U)                
#define STS_DIAG_2_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_3
**/
#define STS_DIAG_3_ID                        0xc0068              
#define STS_DIAG_3_LEN                       (4U)                
#define STS_DIAG_3_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_4
**/
#define STS_DIAG_4_ID                        0xd0000              
#define STS_DIAG_4_LEN                       (4U)                
#define STS_DIAG_4_MASK                      0xFFFFFFFFUL        



/******************************************************************************
* @brief Bit definitions for register STS_DIAG_5
**/
#define STS_DIAG_5_ID                        0xd0004              

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_6
**/
#define STS_DIAG_6_ID                        0xd0008              

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_7
**/
#define STS_DIAG_7_ID                        0xd000c              

