emineminof/DWM3000-ATMega328p/DW3000/DW3000/driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register STS_DIAG_8
**/
#define STS_DIAG_8_ID                        0xd0010              

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_9
**/
#define STS_DIAG_9_ID                        0xd0014              

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_10
**/
#define STS_DIAG_10_ID                       0xd0018              

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_11
**/
#define STS_DIAG_11_ID                       0xd001c              

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_12
**/
#define STS_DIAG_12_ID                       0xd0020              
#define STS_DIAG_12_LEN                      (4U)                
#define STS_DIAG_12_MASK                     0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_13
**/
#define STS_DIAG_13_ID                       0xd0024    

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_14
**/
#define STS_DIAG_14_ID                       0xd0028    

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_15
**/
#define STS_DIAG_15_ID                       0xd002C    

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_16
**/
#define STS_DIAG_16_ID                       0xd0030    

/******************************************************************************
* @brief Bit definitions for register STS_DIAG_17
**/
#define STS_DIAG_17_ID                       0xd0034    

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_0
**/
#define STS1_DIAG_0_ID                        0xd0038              
#define STS1_DIAG_0_LEN                       (4U)                
#define STS1_DIAG_0_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_1
**/
#define STS1_DIAG_1_ID                        0xd003c              
#define STS1_DIAG_1_LEN                       (4U)                
#define STS1_DIAG_1_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_2
**/
#define STS1_DIAG_2_ID                        0xd0040              
#define STS1_DIAG_2_LEN                       (4U)                
#define STS1_DIAG_2_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_3
**/
#define STS1_DIAG_3_ID                        0xd0044              
#define STS1_DIAG_3_LEN                       (4U)                
#define STS1_DIAG_3_MASK                      0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_4
**/
#define STS1_DIAG_4_ID                        0xd0048              
#define STS1_DIAG_4_LEN                       (4U)                
#define STS1_DIAG_4_MASK                      0xFFFFFFFFUL        


/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_5
**/
#define STS1_DIAG_5_ID                        0xd004c              

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_6
**/
#define STS1_DIAG_6_ID                        0xd0050              

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_7
**/
#define STS1_DIAG_7_ID                        0xd0054              

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_8
**/
#define STS1_DIAG_8_ID                        0xd0058              
#define STS1_DIAG_8_LEN                       (4U)                
#define STS1_DIAG_8_MASK                      0xFFFFFFFFUL        


/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_9
**/
#define STS1_DIAG_9_ID                        0xd005c              

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_10
**/
#define STS1_DIAG_10_ID                       0xd0060              

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_11
**/
#define STS1_DIAG_11_ID                       0xd0064              

/******************************************************************************
* @brief Bit definitions for register STS1_DIAG_12
**/
#define STS1_DIAG_12_ID                       0xd0068              
#define STS1_DIAG_12_LEN                      (4U)                
#define STS1_DIAG_12_MASK                     0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register CIA_CONF
**/
#define CIA_CONF_ID                  0xe0000              
#define CIA_CONF_LEN                 (4U)                
#define CIA_CONF_MASK                0xFFFFFFFFUL        
#define CIA_CONF_MINDIAG_BIT_OFFSET  (20U)               
#define CIA_CONF_MINDIAG_BIT_LEN     (1U)                
#define CIA_CONF_MINDIAG_BIT_MASK    0x100000UL                          
#define CIA_CONF_RXANTD_BIT_OFFSET (0U)                
#define CIA_CONF_RXANTD_BIT_LEN (16U)               
#define CIA_CONF_RXANTD_BIT_MASK 0xffffU              

