emineminof/DWM3000-ATMega328p/DW3000/DW3000/driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register EVC_COUNT1
**/
#define EVC_COUNT1_ID                      0xf0008              
#define EVC_COUNT1_LEN                     (4U)                
#define EVC_COUNT1_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT1_EVC_FCE_BIT_OFFSET  (16U)               
#define EVC_COUNT1_EVC_FCE_BIT_LEN     (12U)               
#define EVC_COUNT1_EVC_FCE_BIT_MASK    0xfff0000UL          
#define EVC_COUNT1_EVC_FCG_BIT_OFFSET  (0U)                
#define EVC_COUNT1_EVC_FCG_BIT_LEN     (12U)               
#define EVC_COUNT1_EVC_FCG_BIT_MASK    0xfffU               

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT2
**/
#define EVC_COUNT2_ID                      0xf000c              
#define EVC_COUNT2_LEN                     (4U)                
#define EVC_COUNT2_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT2_EVC_OVR_BIT_OFFSET (16U)               
#define EVC_COUNT2_EVC_OVR_BIT_LEN    (8U)                
#define EVC_COUNT2_EVC_OVR_BIT_MASK   0xff0000UL           
#define EVC_COUNT2_EVC_FFR_BIT_OFFSET   (0U)                
#define EVC_COUNT2_EVC_FFR_BIT_LEN      (8U)                
#define EVC_COUNT2_EVC_FFR_BIT_MASK     0xffU                

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT3
**/
#define EVC_COUNT3_ID                      0xf0010              
#define EVC_COUNT3_LEN                     (4U)                
#define EVC_COUNT3_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT3_EVC_PTO_BIT_OFFSET  (16U)               
#define EVC_COUNT3_EVC_PTO_BIT_LEN     (12U)               
#define EVC_COUNT3_EVC_PTO_BIT_MASK    0xfff0000UL          
#define EVC_COUNT3_EVC_STO_BIT_OFFSET  (0U)                
#define EVC_COUNT3_EVC_STO_BIT_LEN     (12U)               
#define EVC_COUNT3_EVC_STO_BIT_MASK    0xfffU               

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT4
**/
#define EVC_COUNT4_ID                      0xf0014              
#define EVC_COUNT4_LEN                     (4U)                
#define EVC_COUNT4_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT4_EVC_TXFS_BIT_OFFSET  (16U)               
#define EVC_COUNT4_EVC_TXFS_BIT_LEN     (12U)               
#define EVC_COUNT4_EVC_TXFS_BIT_MASK    0xfff0000UL          
#define EVC_COUNT4_EVC_FWTO_BIT_OFFSET   (0U)                
#define EVC_COUNT4_EVC_FWTO_BIT_LEN      (8U)                
#define EVC_COUNT4_EVC_FWTO_BIT_MASK     0xffU                

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT5
**/
#define EVC_COUNT5_ID                      0xf0018              
#define EVC_COUNT5_LEN                     (4U)                
#define EVC_COUNT5_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT5_EVC_SWCE_BIT_OFFSET (16U)               
#define EVC_COUNT5_EVC_SWCE_BIT_LEN    (8U)                
#define EVC_COUNT5_EVC_SWCE_BIT_MASK   0xff0000UL           
#define EVC_COUNT5_EVC_HPW_BIT_OFFSET (0U)                
#define EVC_COUNT5_EVC_HPW_BIT_LEN    (8U)                
#define EVC_COUNT5_EVC_HPW_BIT_MASK   0xffU                

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT6
**/
#define EVC_COUNT6_ID                      0xf001c              
#define EVC_COUNT6_LEN                     (4U)                
#define EVC_COUNT6_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT6_EVC_PREJ_BIT_OFFSET (0U)                
#define EVC_COUNT6_EVC_PREJ_BIT_LEN    (12U)               
#define EVC_COUNT6_EVC_PREJ_BIT_MASK   0xfffU               
            


/******************************************************************************
* @brief Bit definitions for register TEST_CTRL0
**/
#define TEST_CTRL0_ID                        0xf0024              
#define TEST_CTRL0_LEN                       (4U)                
#define TEST_CTRL0_MASK                      0xFFFFFFFFUL        
#define TEST_CTRL0_CIA_RUN_BIT_OFFSET    (26U)               
#define TEST_CTRL0_CIA_RUN_BIT_LEN       (1U)                
#define TEST_CTRL0_CIA_RUN_BIT_MASK      0x4000000UL          
#define TEST_CTRL0_CIA_WDEN_BIT_OFFSET    (24U)               
#define TEST_CTRL0_CIA_WDEN_BIT_LEN       (1U)                
#define TEST_CTRL0_CIA_WDEN_BIT_MASK      0x1000000UL          
#define TEST_CTRL0_HIRQ_POL_BIT_OFFSET       (21U)               
#define TEST_CTRL0_HIRQ_POL_BIT_LEN          (1U)                
#define TEST_CTRL0_HIRQ_POL_BIT_MASK         0x200000UL           
#define TEST_CTRL0_TX_PSTM_BIT_OFFSET          (4U)                
#define TEST_CTRL0_TX_PSTM_BIT_LEN             (1U)                
#define TEST_CTRL0_TX_PSTM_BIT_MASK            0x10U                

/******************************************************************************
* @brief Bit definitions for register EVC_COUNT7
**/
#define EVC_COUNT7_ID                      0xf0028              
#define EVC_COUNT7_LEN                     (4U)                
#define EVC_COUNT7_MASK                    0xFFFFFFFFUL        
#define EVC_COUNT7_EVC_VWARN_BIT_OFFSET  (16U)               
#define EVC_COUNT7_EVC_VWARN_BIT_LEN     (8U)                
#define EVC_COUNT7_EVC_VWARN_BIT_MASK    0xff0000UL           
#define EVC_COUNT7_EVC_CPQE_BIT_OFFSET  (0U)                
#define EVC_COUNT7_EVC_CPQE_BIT_LEN     (8U)                
#define EVC_COUNT7_EVC_CPQE_BIT_MASK    0xffU                

/******************************************************************************
* @brief Bit definitions for register SPI_MODE
**/
#define SPI_MODE_ID                          0xf002c              
#define SPI_MODE_LEN                         (4U)                
#define SPI_MODE_MASK                        0xFFFFFFFFUL        
#define SPI_MODE_SPI_MODE_BIT_OFFSET         (0U)                
#define SPI_MODE_SPI_MODE_BIT_LEN            (2U)                
#define SPI_MODE_SPI_MODE_BIT_MASK           0x3U                 

